# 3. Напишите программу, в которой пользователь будет задавать две строки, а программа - 
# определять количество вхождений одной строки в другой.

str1 = input('Введите первую строку: ')
str2 = input('Введите вторую строку: ')

print(f'{str1.count(str2)} раз')